// Вычислить площадь круга
class Area {
    public static void main(String[] args) {
        double pi;
        float r;
        double a;
        r = 10.8f;      // радиус окружности
        pi = 3.1416;   // приблизительное значение числа пи
        a = pi * r * r;// вычислить площадь круга
        System.out.println("Плoщaдь круга равна " + a);

        double  f = 1234567890_123456090000001d;
        System.out.println(f);
    }
}